[Survived] BlockStatement
15.2/exercise-digimon-finders/src/App.js:6:17
 import Digimon from './Digimon';
 
 class App extends React.Component {
-  constructor() {
-    super();
-    this.state = { searchDigimon: '', isFetching: false, errorMessage: '' };
-
-    this.inputValue = this.inputValue.bind(this);
-    this.requestDigimon = this.requestDigimon.bind(this);
-  }
+  constructor() {}
 
   inputValue(value) {

[Survived] BooleanLiteral
15.2/exercise-digimon-finders/src/App.js:8:51
 class App extends React.Component {
   constructor() {
     super();
-    this.state = { searchDigimon: '', isFetching: false, errorMessage: '' };
+    this.state = { searchDigimon: '', isFetching: true, errorMessage: '' };
 
     this.inputValue = this.inputValue.bind(this);

[Survived] BlockStatement
15.2/exercise-digimon-finders/src/App.js:14:21
     this.requestDigimon = this.requestDigimon.bind(this);
   }
 
-  inputValue(value) {
-    this.setState((state) => ({
-      ...state,
-      searchDigimon: value,
-    }));
-  }
+  inputValue(value) {}
 
   async requestDigimon() {

[Survived] ArrowFunction
15.2/exercise-digimon-finders/src/App.js:15:19
   }
 
   inputValue(value) {
-    this.setState((state) => ({
-      ...state,
-      searchDigimon: value,
-    }));
+    this.setState(() => undefined);
   }
 

[Survived] BlockStatement
15.2/exercise-digimon-finders/src/App.js:21:26
     }));
   }
 
-  async requestDigimon() {
-    const { searchDigimon } = this.state;
-    if (searchDigimon) {
-      fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
-        .then((res) => res.json())
-        .then((results) => this.setState((state) => ({
-          ...state,
-          digimon: results[0],
-          errorMessage: results.ErrorMsg,
-          isFetching: true,
-        })));
-    }
-  }
+  async requestDigimon() {}
 
   render() {

[Survived] BlockStatement
15.2/exercise-digimon-finders/src/App.js:23:24
 
   async requestDigimon() {
     const { searchDigimon } = this.state;
-    if (searchDigimon) {
-      fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
-        .then((res) => res.json())
-        .then((results) => this.setState((state) => ({
-          ...state,
-          digimon: results[0],
-          errorMessage: results.ErrorMsg,
-          isFetching: true,
-        })));
-    }
+    if (searchDigimon) {}
   }
 

[Survived] ConditionalExpression
15.2/exercise-digimon-finders/src/App.js:23:9
 
   async requestDigimon() {
     const { searchDigimon } = this.state;
-    if (searchDigimon) {
+    if (true) {
       fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
         .then((res) => res.json())

[Survived] StringLiteral
15.2/exercise-digimon-finders/src/App.js:24:13
   async requestDigimon() {
     const { searchDigimon } = this.state;
     if (searchDigimon) {
-      fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
+      fetch(``)
         .then((res) => res.json())
         .then((results) => this.setState((state) => ({

[Survived] ArrowFunction
15.2/exercise-digimon-finders/src/App.js:25:15
     const { searchDigimon } = this.state;
     if (searchDigimon) {
       fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
-        .then((res) => res.json())
+        .then(() => undefined)
         .then((results) => this.setState((state) => ({
           ...state,

[Survived] ArrowFunction
15.2/exercise-digimon-finders/src/App.js:26:42
     if (searchDigimon) {
       fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
         .then((res) => res.json())
-        .then((results) => this.setState((state) => ({
-          ...state,
-          digimon: results[0],
-          errorMessage: results.ErrorMsg,
-          isFetching: true,
-        })));
+        .then((results) => this.setState(() => undefined));
     }
   }

[Survived] ArrowFunction
15.2/exercise-digimon-finders/src/App.js:26:15
     if (searchDigimon) {
       fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
         .then((res) => res.json())
-        .then((results) => this.setState((state) => ({
-          ...state,
-          digimon: results[0],
-          errorMessage: results.ErrorMsg,
-          isFetching: true,
-        })));
+        .then(() => undefined);
     }
   }

[Survived] BooleanLiteral
15.2/exercise-digimon-finders/src/App.js:30:23
           ...state,
           digimon: results[0],
           errorMessage: results.ErrorMsg,
-          isFetching: true,
+          isFetching: false,
         })));
     }

[Survived] ArrowFunction
15.2/exercise-digimon-finders/src/App.js:44:24
           <input
             id="search-input"
             value={ searchDigimon }
-            onChange={ ({ target }) => this.inputValue(target.value) }
+            onChange={ () => undefined }
             data-testid="search-input"
           />

[Survived] ConditionalExpression
15.2/exercise-digimon-finders/src/App.js:56:11
           Search Digimon
         </button>
         {
-          isFetching && !errorMessage
+          true
             ? <Digimon digimon={ digimon } />
             : <h1>{errorMessage || 'Faça uma pesquisa'}</h1>

[Survived] LogicalOperator
15.2/exercise-digimon-finders/src/App.js:56:11
           Search Digimon
         </button>
         {
-          isFetching && !errorMessage
+          isFetching || !errorMessage
             ? <Digimon digimon={ digimon } />
             : <h1>{errorMessage || 'Faça uma pesquisa'}</h1>

[Survived] LogicalOperator
15.2/exercise-digimon-finders/src/App.js:58:20
         {
           isFetching && !errorMessage
             ? <Digimon digimon={ digimon } />
-            : <h1>{errorMessage || 'Faça uma pesquisa'}</h1>
+            : <h1>{errorMessage && 'Faça uma pesquisa'}</h1>
         }
       </div>

[Survived] ConditionalExpression
15.2/exercise-digimon-finders/src/App.js:58:20
         {
           isFetching && !errorMessage
             ? <Digimon digimon={ digimon } />
-            : <h1>{errorMessage || 'Faça uma pesquisa'}</h1>
+            : <h1>{true}</h1>
         }
       </div>
